---
kind: type
id: T:Autodesk.Revit.DB.Visual.AdvancedOpaque
source: html/e8a19a97-fc76-71ad-c713-f2a62415475f.htm
---
# Autodesk.Revit.DB.Visual.AdvancedOpaque

A static class that provides access to the property names that appear in the AdvancedOpaque visual asset schema.

## Syntax (C#)
```csharp
public static class AdvancedOpaque
```